/**
 * @@@BUILDINFO@@@ MODULE.jsx 0.1.1 2014 13:34:54 GMT+0200
 * 
 * @module      QTest
 * @summary     Unit-тестирование в стиле <b>QUnit</b>.
 * @desc        Полное описание
 * 
 * @requires   _util.jsx 
 * 
 * @version    0.1.1
 * @author     Slava Boyko <slava.boyko@hotmail.com>
 * @copyright  © Вячеслав aka SlavaBuck, 2014. 
 */

// --------------------------------------------------------------
// TODO: Включение глобальных зависимостей (внешних модулей):
#include "_util.jsx"

// TODO: Это единственное место, где нужно прописать 
// Имя модуля:
/** @alias  */
var MODULE = "QTest";

$.global.hasOwnProperty(MODULE)||(function(GLOBAL, MODULE, CONTEXT) {
    // Регистрация модуля
    GLOBAL[MODULE] = MODULE;
        
    // Модуль:
    MODULE["version"] = "0.1.1";
    MODULE["name"] = "QTest console module";

    // --------------------------------------------------------------
    // Реализация...
	#include "QTest/src/qtest.jsx"

    // --------------------------------------------------------------
    // Фасад модуля:
    // --------------------------------------------------------------
    var FACADE = {
        "QTest":QTest,
        "test":test
    };
    QTest.version = MODULE["version"];
    QTest.name = MODULE["name"];
    // Расширяем модуль фасадом:
    extend(MODULE, FACADE);
    // Расширяем контекст для использования тестовых функций в контексте
    // тестового модуля в стиле QUnit
    extend(CONTEXT, QTest.asserts);
    
    // --------------------------------------------------------------
    // Экспорт в глобал всего фасада (если нужно)
    // --------------------------------------------------------------
    extend(GLOBAL, FACADE);

    // --------------------------------------------------------------
    // Поддержка экспорта для модуля, включаемого с помощью eval():
    // --------------------------------------------------------------
    return MODULE;
    // --------------------------------------------------------------
})( $.global, { toString:function(){return MODULE;} }, this /*импорт внешнего контекста */ );